xmlsamples/PI_MTCN/TW-SMV-AIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:send-money-validation-request>
         <device>
            <id>H2H</id>
            <type>AGENT</type>
         </device>
         <channel>
            <version>9500</version>
         </channel>
         <instant_notification>
            <addl_service_charges>1103FEE12041100130411000103MS</addl_service_charges>
         </instant_notification>
         <sender>
            <name name_type="D">
               <first_name>KHALIL</first_name>
               <last_name>AYERAS</last_name>
            </name>
            <address>
               <addr_line1>LOCATION 1</addr_line1>
               <city>ATHENS</city>
               <postal_code>00000</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>GR</country_code>
                     <currency_code>EUR</currency_code>
                  </iso_code>
               </country_code>
            </address>
            <preferred_customer>
               <permanent_change>EnrollWuCard</permanent_change>
            </preferred_customer>
            <compliance_details>
               <template_id>UNI_01_S</template_id>
               <id_details>
                  <id_type>D</id_type>
                  <id_country_of_issue>TW</id_country_of_issue>
                  <id_place_of_issue>TW</id_place_of_issue>
                  <id_number>FD18981470</id_number>
               </id_details>
               <third_party_details>
                  <flag_pay>N</flag_pay>
               </third_party_details>
               <id_issue_date>30072014</id_issue_date>
               <id_expiration_date>03072029</id_expiration_date>
               <date_of_birth>15091973</date_of_birth>
               <Country_of_Birth>TW</Country_of_Birth>
               <nationality>TW</nationality>
               <Gender>M</Gender>
               <Relationship_to_Receiver_Sender>Family</Relationship_to_Receiver_Sender>
               <ack_flag>X</ack_flag>
            </compliance_details>
            <contact_phone>6987744587</contact_phone>
            <mobile_phone>
               <phone_number/>
            </mobile_phone>
            				<bank_details>
					<name>KTB</name>
					<account_number>235164756890</account_number>
				</bank_details>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>AYDAR</first_name>
               <last_name>Zubayin</last_name>
            </name>
            <address>
               <country_code>
                  <iso_code>
                     <country_code>GR</country_code>
                     <currency_code>EUR</currency_code>
                  </iso_code>
               </country_code>
               <address_type>I</address_type>
            </address>
            <mobile_phone>
               <phone_number/>
            </mobile_phone>
         </receiver>
         <payment_details>
            <expected_payout_location>
               <state_code>FL</state_code>
               <state_name>Florida</state_name>
            </expected_payout_location>
            <destination_country_currency>
               <iso_code>
                  <country_code>US</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>TW</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </originating_country_currency>
            <originating_city>ATHENS</originating_city>
            <originating_state>AT</originating_state>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <exchange_rate>1.0</exchange_rate>
            <fix_on_send>Y</fix_on_send>
            <pay_wo_id_indicator>N</pay_wo_id_indicator>
         </payment_details>
         <financials>
            <taxes>
               <municipal_tax>0</municipal_tax>
               <state_tax>0</state_tax>
               <county_tax>0</county_tax>
            </taxes>
            <originators_principal_amount>201000</originators_principal_amount>
         </financials>
         <delivery_services>
            <code>000</code>
            <message>
               <message_details context="3">
                  <text>HI..HOW ARE YOU</text>
                  <text>HI..HOW ARE YOU</text>
                  <text>HI..HOW ARE YOU</text>
               </message_details>
            </message>
         </delivery_services>
         <foreign_remote_system>
            <identifier>WGHHTW7010T</identifier>
            <reference_no>001CL03223174744</reference_no>
            <counter_id>TW701PP0001A</counter_id>
         </foreign_remote_system>
      </xrsi:send-money-validation-request>
   </soapenv:Body>
</soapenv:Envelope>